{"html":"<p>Bom, já tem uns meses que eu resolvi dedicar alguns dias da minha vida tentando colocar os jogos de Zelda em uma timeline correta.</p>\n<p>Eu fui me baseando na história dos jogos e nos comentários dos desenvolvedores e até que estava indo bem, tirando alguns problemas básicos, como o fato da primeira princesa Zelda que existiu aparecer no Adventure of Link.</p>\n<p>Coisas como esse fato deixam tudo mais complicado, pois afinal se no Ocarina of Time é onde o Ganon nasce, e no Legend of Zelda já existe o Ganon, Ocarina of Time vem antes de Legend of Zelda e Adventure of Link, logo essa princesa Zelda que está adormecida em Adventure of Link está dormindo a séculos.</p>\n<p>Isso tirando pelo fato mais declarado por todos que criam a timeline: Ocarina of Time é o primeiro da timeline. Bem como o Miyamoto uma vez disse “Ocarina of Time is the very first story!“. Acontece que recentemente descobrimos que não é bem assim: Durante a E3 desse ano foi revelado o Skyward Sword, novo jogo da série Zelda para Wii.</p>\n<p>O que acontece é que nesse jogo é revelado como a Master Sword se torna Master Sword, e vendo que a Master Sword já existia no Ocarina of Time, óbviamente Skyward Sword vem de todos os Zeldas. O que fez tudo ficar beeem problemático, pois eu passei horas e horas colocando a timeline junta, e muitas vezes algumas história faziam todo o sentido de ficar antes do Ocarina of Time, mas não podia pelo simples fato de Ocarina of Time ser o primeiro Zelda, bom, não mais.</p>\n<p>Pelo menos o Skyward Sword chegou já explicando MUITO, mesmo com tão pouco revelado. O fato da Skyward Sword poder virar a Master Sword explica perfeitamente porque a Picori Sword e a Lokomo Sword se parecem tanto com a Master Sword – De alguma forma a Master Sword acaba virando a Picori/Lokomo Sword.</p>\n<p>Como pouquissímos detalhes foram revelados sobre o Skyward Sword, eu prefiro não pensar mais na timeline por enquanto, mesmo porque apesar de explicar algumas coisas, o Skyward Sword trouxe muito mais dúvidas do que clarezas.</p>\n<p>Então estou liberando abaixo o post que eu pretendia fazer sobre a timeline de Zelda. Preparem-se para uma gigantesca <a href=\"http://uncyclopedia.wikia.com/wiki/Wall_of_Text\" title=\"Wall of Text\" target=\"_blank\" rel=\"noreferrer\">WOT</a> !</p>\n<p>Depois de pesquisar MUITO, eu completei a minha visão sobre a timeline de Zelda. Eu sei que muitos já fizeram o mesmo, inclusive o site GameTrailer, mas a cada jogo lançado, brexas nessas teorias são criadas.</p>\n<p>Vou mostra-los a minha própria teoria sobre a timeline de Zelda, de todos os Zeldas que eu joguei e de tudo que eu estudei sobre, eu fico satisfeito com essa sendo a timeline “oficial” para mim. Antes de tudo, uma coisa que precisamos entender é que Hyrule não o nome de um mundo, como o nosso é Terra.</p>\n<p>É apenas um continente de um mundo que ainda não foi revelado, assim como Labrynna e Holodrum do Oracle of Ages e Oracle of Seasons são continentes da mesma maneira. Outra coisa importante é saber que o nome héroi do jogo, não é necessáriamente Link, tanto que você pode escolher o nome a cada começo de jogo.</p>\n<p>Certo então, a primeira coisa que sabemos sobre o universo de Zelda, é a criação de Hyrule pelas três Deusas, Din, Nayru e Farore (No ato de criação do mundo de Hyrule, multiplos universos foram criados).</p>\n<p>Então houve a grande guerra em Hyrule, conhecida como Hyrulean Civil War para ver quem ficava com o poder da Triforce, a guerra teve seu fim com a Triforce nas mãos da Familia Real de Hyrule, assim começando os eventos de Ocarina of Time.</p>\n<p>Apesar do anuncio precipitado de Aonuma sobre Four Swords para GBA, no qual ele afirma sobre esse jogo ser o primeiro na timeline de Zelda, eu me baseio mais nas citações no qual ele realmente fazia parte do desenvolvimento da história do jogo, não como produtor, como ele foi em Four Swords. Depois dos eventos em Ocarina of Time, temos a famosa timeline dividida, no qual uma delas o Link volta no tempo e conta para Princesa Zelda tudo sobre o Ganondorf e seus planos, e no outro ele continua no futuro devastado pelo poder de Ganondorf.</p>\n<p>Vamos agora continuar com a timeline no qual Link permanesse adulto. Depois do mundo ter sido destruido pelo Ganondorf, ocorrem os eventos citados na backstory de Wind Waker: O rei e o povo de Hyrule pediram aos Deuses para inundar o mundo, com medo do poder maléfico de Ganon, que de algum jeito ressuscitou e por algum motivo não foi impedido pelo Link.</p>\n<p>Não sei essa história virá a ser algum jogo de Zelda, mas vou deixar uma interrogação nesse ponto. Centenas de anos se passaram e um novo Link nasce, ele recebe uma roupa de sua vó em seu aniversário, como ritual da espera da volta do Héroi do passado. Esses são os acontecimentos de Wind Waker. Esse Link se encontra com uma pirata chamada Tetra que depois se revela ser a reencarnação da princesa de Hyrule, Zelda e o King of Red Lions revela-se ser o antigo rei que inundou Hyrule, Daphnes Nohansen Hyrule.</p>\n<p>Após juntar os pedaços da Triforce da Coragem e matar Ganondorf, Zelda e Link recebem a missão de buscar uma nova terra para governar. Link e Tetra vão em busca de terras novas, e se deparam com um navio fantasma, acarretando os eventos de Phantom Hourglass, onde Link acorda em uma terra desconhecida e Tetra está sumida. Determinado a encontrar Tetra, Link vai em mais uma aventura, onde no final é revelado que Link não estava em seu mundo, e sim no Mundo do Ocean King.</p>\n<p>Ao voltar para seu próprio mundo, os marinheiros do navio de Tetra afirmam que os dois ficaram desacordados no navio fanstasma por apenas 10 minutos, então Link olha em seu bolso e encontra a Phantom Hourglass. Uma aventura em um universo paralelo ou apenas um sonho?</p>\n<p>Na verdade não importa, pois logo em seguida vem os eventos de Spirit Tracks. Muitas citações no próprio jogo mostram que esse novo reino foi encontrado pelos anceistrais de Link e Zelda, que o batizaram de Hyrule, em virtude ao antigo reino esquecido pelas pessoas. Uma coisa esquisita em Spirit Tracks é a Lokomo Sword, esparada que foi concebida pelos Deuses aos humanos para derrotar o mau no passado. Ela tem uma incrível semelhança com a Master Sword. Ela seria a própria com um nome diferente ou cada terra possui sua própria arma para combater o mau?</p>\n<p>Isso fica por aberto, cada um pensa o que quiser. Agora, depois de Spirit Tracks não se sabe muito, então eu vou encaixar um jogo que começa em um jogo que não se sabe muito do passado: Minish Cap. Mas entre Minish Cap e Spirit Tracks eu gostaria de colocar o futuro Zelda para Wii.</p>\n<p>Não que já se saiba bastante sobre o jogo, mas o que tudo indica é que será um jogo que mostrará muito sobre a Master Sword, e talvez explique a transição Master Sword/Picori Sword. No Minish Cap, surge um novo vilão: Vaati.</p>\n<p>Um feiticeiro que a única coisa que deseja é se tornar mais poderoso, e para isso ele precisa da “Light Power” (triforce da sabedoria?) que a princessa Zelda possui. Link mais uma vez tem a missão de salvar a princessa Zelda e no caminho de sua aventura, ele forja a Four Sword e derrota Vaati.</p>\n<p>Como esse Zelda não comenta nada sobre a Triforce ou Ganon, a única coisa que podemos imaginar é que se passa centenas de anos depois de Spirit Tracks, mas uma coisa é certa: Os Minish sempre existiram. Em uma citação do jogo, diz que os Minish se divertem escondendo itens e ruppes debaixo de pedras e nas gramas pelo mundo. Depois de Minish Cap, óbviamente vem o Four Swords de Game Boy Advance, no qual Vaati consegue escapar de sua prisão e rapta a princessa Zelda. Link vai atras para resgatar Zelda e sela novamente Vaati na Four Sword.</p>\n<p>Logo depois vem o Four Swords Adventures, para Game Cube, no qual Vaati é libertado novamente e no final do jogo é revelado que Vaati estava apenas sendo manipulado por Ganon, Link vence Vaati e Ganon e sela Ganon na Four Sword. Aqui termina a timeline do Link adulto de Ocarina of Time. Agora vamos voltar para o inicio de tudo: O Link de Ocarina of Time volta no tempo e conta para Princesa Zelda tudo sobre o Ganondorf e seus planos e Ganondorf é sentenciado a morte.</p>\n<p>Enquanto isso, Link se despede de Zelda, pois vai em busca de sua companheira Navi, que o deixou no final de Ocarina of Time. Enquanto está a procura de Navi, Link se perde em Lost Woods e é abordado por um Skull Kid, que rouba sua Ocarina of Time e a Epona, ao segui-lo, Link é teletransportado para outro mundo, um universo paralelo a Hyrule. Chegando lá, Link fica sabendo que a lua está prestes a cair, e Link tem apenas três dias para deter a lua.</p>\n<p>No final do terceiro dia, Link utiliza a Ocarina of Time para voltar no tempo e assim continuar sua aventura. No final do jogo, não fica muito claro se o Link volta ou não para Hyrule, mas existem teorias de que ele aparece no Twilight Princess em forma de Stalfo, eu falarei sobre isso mais tarde.</p>\n<p>Voltando a timeline, um tempo se passou do Ocarina of Time e uma tribo de magos das trevas conhecidos como Dark Interlopers tentaram conseguir a Triforce utilizando o poder da Fused Shadow mas foram detidos pelos Light Spirits. Novamente não sei se haverá um Zelda baseado nessa história, então vou deixar uma interrogação aqui. Centenas de anos depois, acontecem os eventos de Twilight Princess, no qual Ganondorf tenta dominar Hyrule novamente, mas dessa vez manipulando Zant, um ser do Twilight Realm, que eu também acredito ser o Dark World, assim como muitos.</p>\n<p>Após derrotar Zant, Link batalha com Ganondorf e o derrota com a Master Sword. Após os eventos de Twilight Princess, muitas centenas de anos se passam, e por algum motivos, a Triforce é separada em vários pedaços. Após os acontecimentos de Twilight Princess, começam os the A Link to The Past, no qual é introduzida a Imprisoning War, que não se sabe ao certo se são os eventos ocorrido em Twilight Princess ou Ocarina of Time. A Link to the Past começa em uma noite em que Link acorda com o pedido de socorro feito telepaticamente pela Zelda, que tenta chamar alguém a seu socorro, ao escutar as palavras o Tio de Link pega seu escudo e espada e vai atrás para resgatar a princesa. Link levanta de sua cama e vai atrás de seu tio, para tentar ajudá-lo.</p>\n<p>Mais a frente, novamente Zelda ajuda a Link entrar no castelo revelando uma passagem oculta que havia nos jardins dos cantos, indo por lá, Link encontra seu tio deitado ao chão, ele pede para que fosse ajudar Zelda a se libertar do mago Agahnim. Zelda e Link então se encontram e vão para uma sala secreta, chegando lá encontram com um padre que conta para Link que para acabar com o caos criado por Agahnim, Link precisa recuperar a Master Sword que se encontra escondida em Lost Woods.</p>\n<p>Depois de passar por uma das aventuras mais difíceis de todos os jogos de Zelda, Link e Zelda derrotam Ganon, que planejava fugir do Dark World, manipulando o mago Agahnim a soltá-lo de seu selo, Ganon é selado novamente, juntamente com o Dark world. Depois dos eventos de Link to the Past, por algum motivo Link se ausenta de Hyrule, e Ganon consegue se libertar do Dark World, não é explicado muito bem como. Um novo herói, que não é o Link aparece, é o “Hero of the Light” no qual pode ser escolhido como homem ou mulher no começo do jogo.</p>\n<p>A história se passa em 4 semanas, na primeira semana o herói acorda em uma das casas de A Link to the Past e lhe é passada a tarefa de resgatar a princesa Zelda. Ao decorrer das quatro semanas, o herói fica sabendo mais sobre Ganon e Link e sobre como ele deve impedir Ganon. Na quarta semana o herói derrota Ganon, coloca a Master Sword onde ela pertence e é teletransportado de volta para onde pertence. Muitos anos depois, um novo Link aparece e tem a missão de novamente parar as ações de Ganon, esses são os eventos passados no primeiro Legend of Zelda, que como o próprio Miyamoto disse, A Link to the Past são os ancestrais do Link e Zelda do primeiro Legend of Zelda.</p>\n<p>Depois de juntar os 8 pedaços da Triforce da Sabedoria e derrotar Ganon, começam os eventos de Adventure of Link, onde ele é convocado pra mais uma missão por Impa. Ela revela para Link que muitas gerações atrás, houve um reino onde um rei reinava com justiça e sabedoria utilizando o poder da Triforce. Esse rei escondeu uma parte da Triforce, a Triforce da Coragem, e informou a secreta localização apenas para sua filha Zelda.</p>\n<p>Quando o rei faleceu, seu filho quis saber a localização da Triforce, mas sua irmã Zelda não quis revelar, então ele mandou uma feiticeira utilizar um feitiço para forçar sua irmã a revelar a localização da Triforce, e não obteve sucesso. Então a feiticeira lançou um feitiço na princessa Zelda que a colocou em sono profundo. Aterrorizado com a tragédia, o principe ordenou que a partir daquela geração, todas as princesas de Hyrule deveriam se chamar Zelda.</p>\n<p>Esse foi um acontecimento importantíssimo, o que diferencia muito da timeline de Wind Waker, no qual temos a Tetra. Voltando a Adventure of Link, após Link ter restaurado a Triforce da Coragem e acordado a princessa Zelda, ela é raptada por dragões e começa o Zelda de Game &amp; Watch.</p>\n<p>Muitos desconsideram esse jogo, mas é um lançamento oficial da Nintendo e não deve ser desconsiderado. Após prestar muitos serviços da Familia Real e ter salvo Hyrule, a Triforce convoca Link e o envia para um reinado distante que precisa de ajuda.</p>\n<p>Ai começam os eventos de Oracle of Seasons e Oracle of Ages. Quando um dos dois jogos é terminado e você começa o segundo jogo com o código dado no final do primeiro, a verdadeira história do jogo é revelada. No final do jogo (se você começou com o código depois de terminar o outro) é revelado que Zelda havia sido capturada pelas mães de Ganondorf em função de tentar ressuscitar Ganon.</p>\n<p>No final do jogo Link derrota Ganon e sai em uma jangada de volta para sua terra natal, Hyrule. Mas uma tempestade faz com que ele se perca, e acabe parando na Koholint Island. Link fica sabendo que para deixar essa ilha, ele precisa primeiramente precisa acordar o Wind Fish, e ao acorda-lo, Link descobre que a ilha em que estava era apenas uma criação de um sonho do Wind Fish, o jogo acaba e não fica claro se Link conseguiu voltar para casa ou não.</p>\n<p>Depois de Link’s Awakening, muitos anos se passaram e começam os eventos de A Link to the Past. Eu sei que é praticamente oficial que Link’s Awakening é sequencia de A Link to the Past, mas também houveram muitos erros na tradução do Japonês para o Inglês, mas não seria possível colocar o Link de Link to the Past sendo o protagonista de Oracle of Ages e Oracle of Seasons pelo simples fato de que em Oracle of Age/Seasons você elimina o Ganon, sendo que na sequência de A Link to The Past, onde Link não é o herói e sim “The Hero of Light”, Ganon também é derrotado, tornando essa ligação impossível, pois haveriam dois Ganons ao mesmo tempo em diferentes terras.</p>\n<p>É, bastante coisa! Eu te garanto que essa colocação ai, até antes do anuncio do Skyward Sword era a que mais fazia sentido, apesar de algumas pequenas incoerências, mas que podiam ser concertadas com talvez algum outro jogo entre as histórias.</p>\n<p>Eu farei a timeline novamente, só precisamos saber um pouco mais sobre a história de Skyward Sword. Até lá só nos resta.. não sei, ficar pensando até o cérebro torrar!!!</p>","path":"/pt-br/blog/games/linha-do-tempo-de-zelda-e-skyward-sword/","title":"Linha do tempo de Zelda e Skyward Sword","language":"pt-br","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0yMTc0LWNvdmVyLnBuZzIwMTAtMDctMDNUMDA6MDA6MDAuMDAwWg==","comments":[{"comment":"http://www.zeldauniverse.net/forums/zelda-theorizing/89752-theorists-of-zu-4.html\n\n\nDe uma olhada ná teoria do usuario Cukeman, é a melhor teoria que eu conheço até o presente momento pré SS.\n\n\nCara quanto a sua teoria, ela é boa mas gostaria de te explicar certas coisas, como a parte que vc diz que Ganon Resusitou na linha do link adulto, na verdade ele não esatva morto e sim selado no Sacred Realm, o selo da Master Sword enfraqueceu e por isso ele se libertou, Link não os salvou pq não existia um Link nessa epoca, tanto pelo tempo tanto pois Zelda mandou o Link do OoT devolta pro seu tempo( Como vimos no final de OoT ), até ai tudo bem... \n\nMinish Cap na minha humilde opinião começa antes de Ocarina... Em Minish existem hylians a raça de Link e Zelda com orelhas pontudas, Em WW e posteriormente PH e ST só existem humanos pessoas comuns como nós, com exeção da familia Real e do própio Link. Outro fato é que em Minish Cap as botas de Pegasus que no jogo AlttP é tida como um artefato raro é fabricada por um sapateiro...\n\nA historia dos Dark interlopers acontece antes de Ocarina of Time, pos ainda não existia a Master Sword para selar a entrada para o Sacred Realm... E o Twiligh não é o Dark World pois  Dark World nada mais que doque o Reina Sagrado transformado pelos desejos maleficos de Ganon.\n\nBem tem muito mais coisas, mas espero que leia a teoria do Cukeman e também me adicione no msn para podermos trocar ideias sobre este assunto que muito me agrada.","name":"Jeronimo","date":"2010-08-16 20:08:01"}],"relatedPosts":[{"path":"/pt-br/blog/games/camy-hero-pack-para-quem-nao-aguenta-esperar-o-zelda-para-wii/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0xODI2LWNvdmVyLnBuZzIwMTAtMDItMThUMDA6MDA6MDAuMDAwWg==","title":"Camy Hero Pack - Para quem não aguenta esperar o Zelda para Wii","date":"2010-02-18T00:00:00.000Z"},{"path":"/pt-br/blog/games/linha-do-tempo-em-zelda/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMDkvcG9zdC1pZC0xMzI5LWNvdmVyLnBuZzIwMDktMDktMTVUMDA6MDA6MDAuMDAwWg==","title":"Linha do tempo em Zelda?","date":"2009-09-15T00:00:00.000Z"},{"path":"/pt-br/blog/games/criando-o-meu-acessorio-dos-sonhos-para-jogar-skyward-sword-hd/","postHashId":"Z2FtZXN0cnVlbnVsbDIwMjEtMDctMTRUMDA6MDA6MDAuMDAwWg==","title":"Criando o meu acessório dos sonhos para jogar Skyward Sword HD","date":"2021-07-14T00:00:00.000Z"},{"path":"/pt-br/blog/events/viagem-para-los-angeles-e3-2014/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDE0L3Bvc3QtaWQtMjI2Ni1jb3Zlci5wbmcyMDE0LTA4LTA4VDAwOjAwOjAwLjAwMFo=","title":"Viagem para Los Angeles - E3 2014","date":"2014-08-08T00:00:00.000Z"},{"path":"/pt-br/blog/events/viagem-da-equipe-blast-para-a-e3-2012/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEyL3Bvc3QtaWQtMjIzMy1jb3Zlci5wbmcyMDEyLTEyLTIwVDAwOjAwOjAwLjAwMFo=","title":"Viagem da equipe Blast para a E3 2012","date":"2012-12-20T00:00:00.000Z"},{"path":"/pt-br/blog/events/e3-2012-partiu/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEyL3Bvc3QtaWQtMjIyMS1jb3Zlci5wbmcyMDEyLTA1LTMxVDAwOjAwOjAwLjAwMFo=","title":"E3 2012? Partiu!","date":"2012-05-31T00:00:00.000Z"},{"path":"/pt-br/blog/events/jirachi-do-evento-da-latamel-adquirido/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEwL3Bvc3QtaWQtMTk2Ny1jb3Zlci5wbmcyMDEwLTAzLTIyVDAwOjAwOjAwLjAwMFo=","title":"Jirachi do evento da Latamel: Adquirido","date":"2010-03-22T00:00:00.000Z"},{"path":"/pt-br/blog/games/unboxing-do-pokemon-soul-silver/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0xOTYwLWNvdmVyLnBuZzIwMTAtMDMtMjFUMDA6MDA6MDAuMDAwWg==","title":"Unboxing do Pokémon Soul Silver","date":"2010-03-21T00:00:00.000Z"},{"path":"/pt-br/blog/general/primeiro-post/","postHashId":"Z2VuZXJhbHRydWUuLi8uLi9jb3ZlcnMvMjAwOC9wb3N0LWlkLTEtY292ZXIucG5nMjAwOC0wOS0yOFQwMDowMDowMC4wMDBa","title":"Primeiro Post","date":"2008-09-28T00:00:00.000Z"},{"path":"/pt-br/blog/games/como-carregar-arquivos-de-forma-assincrona-com-o-phaser-3/","postHashId":"Z2FtZXN0cnVlbnVsbDIwMjEtMTEtMThUMDA6MDA6MDAuMDAwWg==","title":"Como carregar arquivos de forma assíncrona com o Phaser 3","date":"2021-11-18T00:00:00.000Z"}]}