{"html":"<p>Well, it is been a few months since I decided to dedicate a few days of my life trying to put Zelda games on a correct timeline.</p>\n<p>I was based on the history of the games and the comments of the developers and until I was doing well, taking out some basic problems, like the fact that the first Princess Zelda that existed appeared in Adventure of Link.</p>\n<p>Things like that make things more complicated, because after all if in Ocarina of Time is where Ganon is born, and in Legend of Zelda there is already Ganon, Ocarina of Time comes before Legend of Zelda and Adventure of Link, soon this Princess Zelda who is asleep in Adventure of Link has been sleeping for centuries.</p>\n<p>This aside from the fact most declared by everyone who creates the timeline: Ocarina of Time is the first on the timeline. Much like Miyamoto once said “Ocarina of Time is the very first story!“. It turns out that we recently discovered that it is not quite like that: During this year’s E3, Skyward Sword, the new game in the Zelda series for Wii, was revealed.</p>\n<p>What happens is that in this game it is revealed how the Master Sword becomes Master Sword, and seeing that the Master Sword already existed in the Ocarina of Time, obviously Skyward Sword comes from all Zeldas. Which made it all very problematic, as I spent hours and hours putting the timeline together, and often some stories made perfect sense to stay before Ocarina of Time, but I couldn’t because of the simple fact that Ocarina of Time was the first Zelda , well, no more.</p>\n<p>At least Skyward Sword arrived already explaining A LOT, even with so little revealed. The fact that Skyward Sword can become Master Sword explains perfectly why Picori Sword and Lokomo Sword look so much like Master Sword - Somehow Master Sword ends up becoming Picori / Lokomo Sword.</p>\n<p>As few details were revealed about Skyward Sword, I prefer not to think about the timeline for now, even though despite explaining some things, Skyward Sword brought much more doubts than clarity.</p>\n<p>So I’m releasing below the post I intended to do on Zelda’s timeline. Get ready for a huge <a href=\"http://uncyclopedia.wikia.com/wiki/Wall_of_Text\" title=\"Wall of Text\" target=\"_blank\" rel=\"noreferrer\">WOT</a>!</p>\n<p>After researching A LOT, I completed my vision on Zelda’s timeline. I know that many have already done the same, including the GameTrailer website, but with each game released, gaps in these theories are created.</p>\n<p>I’m going to show you my own theory about Zelda’s timeline, of all the Zeldas I’ve played and everything I’ve studied about, I’m satisfied with this being the “official” timeline for me. First of all, one thing we need to understand is that Hyrule is not the name of a world, as ours is Earth.</p>\n<p>It is just a continent of a world that has not yet been revealed, just as Labrynna and Holodrum from Oracle of Ages and Oracle of Seasons are continents in the same way. Another important thing is to know that the game’s hero name is not necessarily Link, so much so that you can choose the name every game start.</p>\n<p>Right then, the first thing we know about the Zelda universe, is the creation of Hyrule by the three Goddesses, Din, Nayru and Farore (In the act of creating the world of Hyrule, multiple universes were created).</p>\n<p>Then there was the great war in Hyrule, known as the Hyrulean Civil War to see who had the power of the Triforce, the war ended with the Triforce in the hands of the Royal Family of Hyrule, thus beginning the events of Ocarina of Time.</p>\n<p>Despite Aonuma’s hasty announcement about Four Swords for GBA, in which he claims that this game is the first on Zelda’s timeline, I rely more on the quotes in which he really was part of the game’s story development, not as a producer, like he was on Four Swords. After the events in Ocarina of Time, we have the famous split timeline, in which one Link goes back in time and tells Princess Zelda everything about Ganondorf and his plans, and in the other he continues in the future devastated by Ganondorf’s power.</p>\n<p>We will now continue with the timeline in which Link would remain an adult. After the world was destroyed by Ganondorf, the events mentioned in the backstory of Wind Waker occur: The king and the people of Hyrule asked the Gods to flood the world, afraid of the evil power of Ganon, who somehow resurrected and for some reason. reason was not prevented by Link.</p>\n<p>I don’t know this story will turn out to be some Zelda game, but I’ll leave a question at that point. Hundreds of years have passed and a new Link is born, he receives an outfit from his grandmother on his birthday, as a ritual of waiting for the hero to return from the past. These are the events of Wind Waker. This Link meets a pirate named Tetra who later reveals himself to be the reincarnation of the princess of Hyrule, Zelda and the King of Red Lions is revealed to be the former king who flooded Hyrule, Daphnes Nohansen Hyrule.</p>\n<p>After collecting the pieces of the Triforce of Courage and killing Ganondorf, Zelda and Link are given the mission to seek a new land to rule. Link and Tetra go in search of new lands, and are faced with a ghost ship, causing the events of Phantom Hourglass, where Link wakes up in an unknown land and Tetra is missing. Determined to find Tetra, Link goes on yet another adventure, where in the end it is revealed that Link was not in his world, but in the World of the Ocean King.</p>\n<p>Upon returning to their own world, the sailors on Tetra’s ship claim that the two were unconscious on the fanstasma ship for just 10 minutes, so Link looks in his pocket and finds the Phantom Hourglass. An adventure in a parallel universe or just a dream?</p>\n<p>It doesn’t really matter, as Spirit Tracks events follow. Many quotes in the game itself show that this new realm was found by Link and Zelda’s ancestors, who named it Hyrule, because of the old realm forgotten by people. One weird thing about Spirit Tracks is the Lokomo Sword, which was designed by the Gods to humans to defeat the bad in the past. She has an incredible resemblance to the Master Sword. Would it be itself with a different name, or does each land have its own weapon to fight evil?</p>\n<p>This remains open, everyone thinks what they want. Now, after Spirit Tracks, not much is known, so I’m going to fit a game that starts in a game that doesn’t know much about the past: Minish Cap. But between Minish Cap and Spirit Tracks I would like to put the future Zelda for Wii.</p>\n<p>Not that much is already known about the game, but what everything indicates is that it will be a game that will show a lot about Master Sword, and perhaps explain the Master Sword / Picori Sword transition. In Minish Cap, a new villain appears: Vaati.</p>\n<p>A sorcerer who only wants to become more powerful, and for that he needs the “Light Power” (triforce of wisdom?) That Princess Zelda has. Link once again has the mission to save Princess Zelda and on the way to his adventure, he forges the Four Sword and defeats Vaati.</p>\n<p>Since this Zelda doesn’t comment on Triforce or Ganon, the only thing we can imagine is that it is hundreds of years after Spirit Tracks, but one thing is certain: Minish have always existed. In a quote from the game, it says that the Minish have fun hiding items and breaks under rocks and grass around the world. After Minish Cap, obviously comes the Game Boy Advance’s Four Swords, in which Vaati manages to escape his prison and kidnaps Princess Zelda. Link goes after it to rescue Zelda and reseals Vaati on the Four Sword.</p>\n<p>Shortly thereafter comes the Four Swords Adventures, for Game Cube, in which Vaati is released again and at the end of the game it is revealed that Vaati was just being manipulated by Ganon, Link defeats Vaati and Ganon and saddles Ganon on the Four Sword. Here ends the timeline of the adult link for Ocarina of Time. Now let’s go back to the beginning of everything: Ocarina of Time’s Link goes back in time and tells Princess Zelda everything about Ganondorf and his plans and Ganondorf is sentenced to death.</p>\n<p>Meanwhile, Link says goodbye to Zelda as he goes in search of his companion Navi, who left him at the end of Ocarina of Time. While looking for Navi, Link gets lost in Lost Woods and is approached by a Skull Kid, who steals his Ocarina of Time and Epona, while following him, Link is teleported to another world, a universe parallel to Hyrule. Once there, Link learns that the moon is about to fall, and Link has only three days to stop the moon.</p>\n<p>At the end of the third day, Link uses the Ocarina of Time to go back in time and continue his adventure. At the end of the game, it is not very clear whether or not Link returns to Hyrule, but there are theories that he appears in the Twilight Princess in the form of Stalfo, I will talk about this later.</p>\n<p>Returning to the timeline, a while passed by Ocarina of Time and a tribe of dark magicians known as Dark Interlopers tried to get the Triforce using the power of the Fused Shadow but were stopped by the Light Spirits. Again, I don’t know if there will be a Zelda based on this story, so I’ll leave a question here. Hundreds of years later, the events of Twilight Princess take place, in which Ganondorf tries to dominate Hyrule again, but this time manipulating Zant, a being of the Twilight Realm, which I also believe to be the Dark World, as well as many.</p>\n<p>After defeating Zant, Link battles Ganondorf and defeats him with the Master Sword. After the events of Twilight Princess, many hundreds of years pass, and for some reason, Triforce is separated into several pieces. After the events of Twilight Princess, the A Link to The Past begins, in which the Imprisoning War is introduced, which is not known for sure if the events occurred in Twilight Princess or Ocarina of Time. Link to the Past begins on a night when Link wakes up to the telepathic cry for help made by Zelda, who tries to call someone to her rescue, upon hearing the words Link’s Uncle takes his shield and sword and goes after it to rescue the Princess. Link gets up from his bed and goes after his uncle, to try to help him.</p>\n<p>Ahead, again Zelda helps Link enter the castle by revealing a hidden passage that was in the corner gardens, going there, Link finds his uncle lying on the floor, he asks him to help Zelda to free himself from the wizard Agahnim. Zelda and Link then meet and go to a secret room, arriving there with a priest who tells Link that to end the chaos created by Agahnim, Link needs to recover the Master Sword that is hidden in Lost Woods.</p>\n<p>After going through one of the most difficult adventures of all Zelda games, Link and Zelda defeat Ganon, who planned to escape the Dark World, manipulating the wizard Agahnim to release him from his seal, Ganon is sealed again, along with the Dark world. After the events of Link to the Past, for some reason Link is absent from Hyrule, and Ganon manages to break free from the Dark World, it is not explained very well how. A new hero, who is not Link appears, is the “Hero of the Light” in which he can be chosen as a man or woman at the beginning of the game.</p>\n<p>The story takes place in 4 weeks, in the first week the hero wakes up in one of the houses of A Link to the Past and is given the task of rescuing Princess Zelda. Over the course of the four weeks, the hero learns more about Ganon and Link and how he should stop Ganon. In the fourth week the hero defeats Ganon, places the Master Sword where it belongs and is teleported back to where it belongs. Many years later, a new Link appears and has the mission to stop Ganon’s actions again, these are the events that took place in the first Legend of Zelda, which as Miyamoto himself said, A Link to the Past are the ancestors of Link and Zelda of the first Legend of Zelda.</p>\n<p>After gathering the 8 pieces of the Triforce of Wisdom and defeating Ganon, the Adventure of Link events begin, where he is summoned for another mission by Impa. It reveals to Link that many generations ago, there was a kingdom where a king reigned with justice and wisdom using the power of the Triforce. This king hid a part of the Triforce, the Triforce of Courage, and reported the secret location only to his daughter Zelda.</p>\n<p>When the king passed away, his son wanted to know the location of the Triforce, but his sister Zelda did not want to reveal it, so he sent a witch to use a spell to force his sister to reveal the location of the Triforce, and was unsuccessful. Then the witch cast a spell on Princess Zelda that put her to sleep. Terrified by the tragedy, the prince ordered that from that generation, all the princesses of Hyrule should be called Zelda.</p>\n<p>This was a very important event, which is very different from the Wind Waker timeline, in which we have Tetra. Returning to Adventure of Link, after Link restored the Triforce of Courage and woke up Princess Zelda, she is kidnapped by dragons and begins the Game &amp; Watch Zelda.</p>\n<p>Many disregard this game, but it is an official Nintendo release and should not be disregarded. After providing many services of the Royal Family and saving Hyrule, Triforce summons Link and sends him to a distant kingdom that needs help.</p>\n<p>Then the Oracle of Seasons and Oracle of Ages events begin. When one of the two games is finished and you start the second game with the code given at the end of the first, the true story of the game is revealed. At the end of the game (if you started with the code after finishing the other one) it is revealed that Zelda had been captured by Ganondorf’s mothers due to trying to resuscitate Ganon.</p>\n<p>At the end of the game Link defeats Ganon and goes out on a raft back to his homeland, Hyrule. But a storm causes him to get lost, and ends up stopping on Koholint Island. Link learns that to leave this island, he first needs to wake up Wind Fish, and upon waking him up, Link discovers that the island he was on was just a creation of a Wind Fish dream, the game is over and it is not clear whether Link made it home or not.</p>\n<p>After Link’s Awakening, many years have passed and A Link to the Past events begin. I know it’s almost official that Link’s Awakening is a sequel to A Link to the Past, but there were also a lot of mistakes in translating from Japanese to English, but it wouldn’t be possible to put Link to the Past as the protagonist of Oracle of Ages and Oracle of Seasons for the simple fact that in Oracle of Age / Seasons you eliminate Ganon, and following A Link to The Past, where Link is not the hero but “The Hero of Light”, Ganon is also defeated , making this connection impossible, as there would be two Ganons at the same time in different lands.</p>\n<p>Yeah, quite a lot! I guarantee you that this placement there, even before the Skyward Sword announcement was the one that made the most sense, despite some small inconsistencies, but that could be fixed with perhaps some other game between the stories.</p>\n<p>I will do the timeline again, we just need to know a little more about the Skyward Sword story. Until then, we only have … I don’t know, keep thinking until the brain burns !!!</p>","path":"/en/blog/games/zelda-timeline-and-skyward-sword-placement/","title":"Zelda timeline and Skyward Sword placement","language":"en","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0yMTc0LWNvdmVyLnBuZzIwMTAtMDctMDNUMDA6MDA6MDAuMDAwWg==","comments":[],"relatedPosts":[{"path":"/en/blog/games/creating-my-dream-skyward-sword-hd-switch-accessories/","postHashId":"Z2FtZXN0cnVlbnVsbDIwMjEtMDctMTRUMDA6MDA6MDAuMDAwWg==","title":"Creating my dream Skyward Sword HD Switch accessories","date":"2021-07-14T00:00:00.000Z"},{"path":"/en/blog/games/camy-hero-pack-for-those-who-cannot-wait-for-the-new-zelda/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0xODI2LWNvdmVyLnBuZzIwMTAtMDItMThUMDA6MDA6MDAuMDAwWg==","title":"Camy Hero Pack - For those who cannot wait for the next Zelda","date":"2010-02-18T00:00:00.000Z"},{"path":"/en/blog/games/zelda-timeline/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMDkvcG9zdC1pZC0xMzI5LWNvdmVyLnBuZzIwMDktMDktMTVUMDA6MDA6MDAuMDAwWg==","title":"Zelda timeline?","date":"2009-09-15T00:00:00.000Z"},{"path":"/en/blog/events/trip-to-la-e3-2014/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDE0L3Bvc3QtaWQtMjI2Ni1jb3Zlci5wbmcyMDE0LTA4LTA4VDAwOjAwOjAwLjAwMFo=","title":"Trip to LA - E3 2014","date":"2014-08-08T00:00:00.000Z"},{"path":"/en/blog/events/trip-to-e3-2012/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEyL3Bvc3QtaWQtMjIzMy1jb3Zlci5wbmcyMDEyLTEyLTIwVDAwOjAwOjAwLjAwMFo=","title":"Trip to E3 2012","date":"2012-12-20T00:00:00.000Z"},{"path":"/en/blog/events/e3-2012-and-here-we-go/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEyL3Bvc3QtaWQtMjIyMS1jb3Zlci5wbmcyMDEyLTA1LTMxVDAwOjAwOjAwLjAwMFo=","title":"E3 2012 - And here we... Go","date":"2012-05-31T00:00:00.000Z"},{"path":"/en/blog/events/jirachi-from-latamel-event/","postHashId":"ZXZlbnRzdHJ1ZS4uLy4uL2NvdmVycy8yMDEwL3Bvc3QtaWQtMTk2Ny1jb3Zlci5wbmcyMDEwLTAzLTIyVDAwOjAwOjAwLjAwMFo=","title":"Jirachi from Latamel event","date":"2010-03-22T00:00:00.000Z"},{"path":"/en/blog/games/pokemon-soul-silver-unboxing/","postHashId":"Z2FtZXN0cnVlLi4vLi4vY292ZXJzLzIwMTAvcG9zdC1pZC0xOTYwLWNvdmVyLnBuZzIwMTAtMDMtMjFUMDA6MDA6MDAuMDAwWg==","title":"Pokémon Soul Silver Unboxing","date":"2010-03-21T00:00:00.000Z"},{"path":"/en/blog/general/first-post/","postHashId":"Z2VuZXJhbHRydWUuLi8uLi9jb3ZlcnMvMjAwOC9wb3N0LWlkLTEtY292ZXIucG5nMjAwOC0wOS0yOFQwMDowMDowMC4wMDBa","title":"First Post","date":"2008-09-28T00:00:00.000Z"},{"path":"/en/blog/games/e3-2023-dates-revealed/","postHashId":"Z2FtZXN0cnVlbnVsbDIwMjItMDktMjdUMDA6MDA6MDAuMDAwWg==","title":"E3 2023 dates revealed","date":"2022-09-27T00:00:00.000Z"}]}